perf/1cpu.epoll.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        AKENOQ
Server Hostname:        127.0.0.1
Server Port:            5933

Document Path:          /httptest/pic_ask.gif
Document Length:        1747 bytes

Concurrency Level:      100
Time taken for tests:   22.588 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      188500000 bytes
HTML transferred:       174700000 bytes
Requests per second:    4427.11 [#/sec] (mean)
Time per request:       22.588 [ms] (mean)
Time per request:       0.226 [ms] (mean, across all concurrent requests)
Transfer rate:          8149.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0      17
Processing:     1   22   3.6     22      76
Waiting:        1   22   3.4     22      76
Total:          4   23   3.5     22      77

Percentage of the requests served within a certain time (ms)
  50%     22
  66%     23
  75%     23
  80%     24
  90%     25
  95%     28
  98%     32
  99%     37
 100%     77 (longest request)