perf/2cpu.epoll.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        AKENOQ
Server Hostname:        127.0.0.1
Server Port:            5933

Document Path:          /httptest/pic_ask.gif
Document Length:        1747 bytes

Concurrency Level:      100
Time taken for tests:   15.952 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      188500000 bytes
HTML transferred:       174700000 bytes
Requests per second:    6268.97 [#/sec] (mean)
Time per request:       15.952 [ms] (mean)
Time per request:       0.160 [ms] (mean, across all concurrent requests)
Transfer rate:          11540.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.8      0      23
Processing:     1   15   6.6     14     105
Waiting:        1   14   6.3     13     104
Total:          3   16   6.2     14     105

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     16
  75%     18
  80%     19
  90%     23
  95%     27
  98%     34
  99%     41
 100%    105 (longest request)