perf/nginx.g.log
$ ab -n 100000 -c 100 http://127.0.0.1/httptest/pic_ask.gif
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 10000 requests
Completed 20000 requests
Completed 30000 requests
Completed 40000 requests
Completed 50000 requests
Completed 60000 requests
Completed 70000 requests
Completed 80000 requests
Completed 90000 requests
Completed 100000 requests
Finished 100000 requests


Server Software:        nginx/1.10.3
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /httptest/pic_ask.gif
Document Length:        1747 bytes

Concurrency Level:      100
Time taken for tests:   5.776 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      199000000 bytes
HTML transferred:       174700000 bytes
Requests per second:    17312.48 [#/sec] (mean)
Time per request:       5.776 [ms] (mean)
Time per request:       0.058 [ms] (mean, across all concurrent requests)
Transfer rate:          33644.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.5      2       5
Processing:     0    3   0.7      3       7
Waiting:        0    2   0.7      2       6
Total:          0    6   0.8      6       9

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      6
  75%      6
  80%      6
  90%      7
  95%      7
  98%      7
  99%      8
 100%      9 (longest request)